In [1]:
import pandas as pd

In [ ]:
import pandas as pd

df = pd.DataFrame(columns=['fname', 'lname', 'std_id', 'age', 'sex'])
df.loc[0] = ['Ali', 'Mahmoodi', 555, 22, 'M']
df.loc[1] = ['Samira', 'Sadeghi', 333, 23, 'F']
df.loc[2] = ['Parisa', 'Alivand', 666, None, 'F']
df.loc[3] = ['Armin', 'Vahedi', 111, 24, 'M']
df.loc[4] = ['Reza', 'Yasi', 222, 27, 'M']
df.loc[5] = ['Hassan', 'Bahadori', 444, None, None]

print(df['age'].mean())
print(df['fname'].count())

24.0
6

In [ ]:
df = pd.DataFrame(columns=['fname', 'lname', 'std_id', 'age', 'sex'])
df.loc[0] = ['Ali', 'Mahmoodi', 555, 22, 'M']
df.loc[1] = ['Samira', 'Sadeghi', 333, 23, 'F']
df.loc[2] = ['Parisa', 'Alivand', 666, None, 'F']
df.loc[3] = ['Armin', 'Vahedi', 111, 24, 'M']
df.loc[4] = ['Reza', 'Yasi', 222, 27, 'M']
df.loc[5] = ['Hassan', 'Bahadori', 444, None, None]

x = df['age'] > 23
print(x.count())
print(x.sum())
pritnt(df['age'].isna().sum())

6
2

In [7]:
df = pd.DataFrame(columns=['fname', 'lname', 'std_id', 'age', 'sex'])
df.loc[0] = ['Ali', 'Mahmoodi', 555, 22, 'M']
df.loc[1] = ['Samira', 'Sadeghi', 333, 23, 'F']
df.loc[2] = ['Parisa', 'Alivand', 666, None, 'F']
df.loc[3] = ['Armin', 'Vahedi', 111, 24, 'M']
df.loc[4] = ['Reza', 'Yasi', 222, 27, 'M']
df.loc[5] = ['Hassan', 'Bahadori', 444, None, None]


print(df.isna().sum())

fname     0
lname     0
std_id    0
age       2
sex       1
dtype: int64

In [8]:
df = pd.DataFrame(columns=['fname', 'lname', 'std_id', 'age', 'sex'])
df.loc[0] = ['Ali', 'Mahmoodi', 555, 22, 'M']
df.loc[1] = ['Samira', 'Sadeghi', 333, 23, 'F']
df.loc[2] = ['Parisa', 'Alivand', 666, None, 'F']
df.loc[3] = ['Armin', 'Vahedi', 111, 24, 'M']
df.loc[4] = ['Reza', 'Yasi', 222, 27, 'M']
df.loc[5] = ['Hassan', 'Bahadori', 444, None, None]


print(df.isna())

   fname  lname  std_id    age    sex
0  False  False   False  False  False
1  False  False   False  False  False
2  False  False   False   True  False
3  False  False   False  False  False
4  False  False   False  False  False
5  False  False   False   True   True

In [14]:
df = pd.DataFrame(columns=['fname', 'lname', 'std_id', 'age', 'sex'])
df.loc[0] = ['Ali', 'Mahmoodi', 555, 22, 'M']
df.loc[1] = ['Samira', 'Sadeghi', 333, 23, 'F']
df.loc[2] = ['Parisa', 'Alivand', 666, None, 'F']
df.loc[3] = ['Armin', 'Vahedi', 111, 24, 'M']
df.loc[4] = ['Reza', 'Yasi', 222, 27, 'M']
df.loc[5] = ['Hassan', 'Bahadori', 444, None, None]


print(df.isna().sum())

fname     0
lname     0
std_id    0
age       2
sex       1
dtype: int64

In [10]:
df = pd.DataFrame(columns=['fname', 'lname', 'std_id', 'age', 'sex'])
df.loc[0] = ['Ali', 'Mahmoodi', 555, 22, 'M']
df.loc[1] = ['Samira', 'Sadeghi', 333, 23, 'F']
df.loc[2] = ['Parisa', 'Alivand', 666, None, 'F']
df.loc[3] = ['Armin', 'Vahedi', 111, 24, 'M']
df.loc[4] = ['Reza', 'Yasi', 222, 27, 'M']
df.loc[5] = ['Hassan', 'Bahadori', 444, None, None]


print(df.isna().sum().sum())

3

In [18]:
titanic_data = pd.read_csv('titanic.csv')
print(titanic_data.columns)

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [22]:
titanic_data.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [21]:
titanic_data['Age'].mean()

29.69911764705882

In [ ]:
titanic_data['Sex'].unique()
titanic_data['Sex'].unique().size

2

In [23]:
titanic_data_p = pd.read_csv('titanic.csv', skiprows=10, nrows=10)